SUCCEESS_UPDATE = '❕ Ваша анкета была обновлена\n\nВы сможете продолжить знакомиться только после подтверждения анкеты администраторами'

SUCCEESS_CREATE = '❕ Ваша анкета создана\n\nВы сможете начать знакомиться только после подтверждения анкеты администраторами'

NEW_PROFILE = '❤️ +1 анкета на проверку'

BANNED = 'Вы заблокированы навсегда'

BLOCKED = 'Вы сможете изменить анкету только после разморозки вашего профиля админами'

WITH_PROFILE = 'У вас уже есть анкета, вы можете изменить ее в разделе «Мой профиль»'

WAIT_PROFILE = 'Вы уже создали анкету, ожидайте подтверждения'

SUPPORT_TEXT = 'Обратитесь в тех. поддержку проекта - @managerbotstg'